ERM/src/Documents/SalesOrderProblem.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>SalesOrderProblem</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SalesOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Reason</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SalesOrderStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Billed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpectedDateForInvoice</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EscalateTo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EscalationLevels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResponsiblesList</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FollowUpDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActionItem</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Responsibles</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Responsible</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LDAPUsers</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/InformationRegisters/ОчередьУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ОчередьУведомлений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаУведомления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проблема</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrderProblem</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EscalationLevels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Enums/SalesOrderBilledStatus/SalesOrderBilledStatus.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SalesOrderBilledStatus</name>
  <enumValues>
    <name>Unbilled</name>
  </enumValues>
  <enumValues>
    <name>Billed</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
</mdclass:Enum>

ERM/src/Catalogs/ВидыУведомлений/ВидыУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыУведомлений</name>
  <predefined>
    <items>
      <name>BrokenPromises</name>
      <description>Broken promises</description>
    </items>
    <items>
      <name>Notification1</name>
      <description>Notification 1</description>
    </items>
    <items>
      <name>Notification2</name>
      <description>Notification 2</description>
    </items>
    <items>
      <name>Notification3</name>
      <description>Notification 3</description>
    </items>
    <items>
      <name>Notification4</name>
      <description>Notification 4</description>
    </items>
    <items>
      <name>Notification5</name>
      <description>Notification 5</description>
    </items>
    <items>
      <name>RWDDeadline</name>
      <description>RWD Deadline</description>
    </items>
    <items>
      <name>RWDDeadlinePrimary</name>
      <description>RWD Deadline primary</description>
    </items>
  </predefined>
</mdclass:Catalog>

ERM/src/Documents/SalesOrderProblem/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() ИЛИ ОбменДанными.Загрузка Тогда
		
		ResponsiblesСтрокой = "";
		
		Если Responsibles.Количество() > 0 Тогда
			Для каждого СтрокаТЧ Из Responsibles Цикл
				ResponsiblesСтрокой = ResponsiblesСтрокой + СтрокаТЧ.Responsible + ", ";
			КонецЦикла;
			ResponsiblesСтрокой = Лев(ResponsiblesСтрокой, СтрДлина(ResponsiblesСтрокой) - 2);
		КонецЕсли;
		
		Если ResponsiblesList <> ResponsiblesСтрокой Тогда
			ResponsiblesList = ResponsiblesСтрокой;
		КонецЕсли;
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(EscalateTo) И Responsibles.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Responsibles are empty!", , , "Объект.Responsibles", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(EscalateTo) И Billed <> Перечисления.SalesOrderBilledStatus.Billed И Billed <> Перечисления.SalesOrderBilledStatus.Canceled Тогда
		
		ДобавитьВОчередьУведомлений();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВОчередьУведомлений()
	
	ТекущаяДата = НачалоДня(ТекущаяДата());
	DateNotification1 = КалендарныеГрафики.ПолучитьДатуПоКалендарю(КалендарныеГрафики.ПроизводственныйКалендарьРоссийскойФедерации(), НачалоМесяца(ТекущаяДата), 5);
	//DateNotification2 = DateLevel1 + 5 * 24 * 60 * 60;
	//DateNotification3 = DateLevel1 + 10 * 24 * 60 * 60;
	//DateNotification4 = DateLevel1 + 14 * 24 * 60 * 60;
	//DateNotification5 = НачалоМесяца(ТекущаяДата) + 25 * 24 * 60 * 60;
	
	ДатыНотификации = Новый Массив;
	ДатыНотификации.Добавить(DateNotification1);
	ДатыНотификации.Добавить(DateNotification1 + 5 * 24 * 60 * 60);
	ДатыНотификации.Добавить(DateNotification1 + 10 * 24 * 60 * 60);
	ДатыНотификации.Добавить(DateNotification1 + 14 * 24 * 60 * 60);
	ДатыНотификации.Добавить(НачалоМесяца(ТекущаяДата) + 24 * 24 * 60 * 60);
	
	ВидыНотификаций = Новый Массив;
	ВидыНотификаций.Добавить(Справочники.ВидыУведомлений.Notification1);
	ВидыНотификаций.Добавить(Справочники.ВидыУведомлений.Notification2);
	ВидыНотификаций.Добавить(Справочники.ВидыУведомлений.Notification3);
	ВидыНотификаций.Добавить(Справочники.ВидыУведомлений.Notification4);
	ВидыНотификаций.Добавить(Справочники.ВидыУведомлений.Notification5);
	
	МассивУровней = Новый Массив;
	МассивУровней.Добавить(Справочники.EscalationLevels.Level1);
	МассивУровней.Добавить(Справочники.EscalationLevels.Level2);
	МассивУровней.Добавить(Справочники.EscalationLevels.Level3);
	МассивУровней.Добавить(Справочники.EscalationLevels.Level4);
	МассивУровней.Добавить(Справочники.EscalationLevels.Level4);
	
	СтруктураПодчиненияУровней = Новый Соответствие;
	Подчинение1 = Новый Массив;
	Подчинение2 = Новый Массив;
	Подчинение2.Добавить(Справочники.EscalationLevels.Level1);
	Подчинение3 = Новый Массив;
	Подчинение3.Добавить(Справочники.EscalationLevels.Level1);
	Подчинение3.Добавить(Справочники.EscalationLevels.Level2);
	Подчинение4 = Новый Массив;
	Подчинение4.Добавить(Справочники.EscalationLevels.Level1);
	Подчинение4.Добавить(Справочники.EscalationLevels.Level2);
	Подчинение4.Добавить(Справочники.EscalationLevels.Level3);
	СтруктураПодчиненияУровней.Вставить(Справочники.EscalationLevels.Level1, Подчинение1);
	СтруктураПодчиненияУровней.Вставить(Справочники.EscalationLevels.Level2, Подчинение2);
	СтруктураПодчиненияУровней.Вставить(Справочники.EscalationLevels.Level3, Подчинение3);
	СтруктураПодчиненияУровней.Вставить(Справочники.EscalationLevels.Level4, Подчинение4);
	
	ИндексУровня = МассивУровней.Найти(EscalateTo);
	
	НЗ = РегистрыСведений.ОчередьУведомлений.СоздатьНаборЗаписей();
	НЗ.Отбор.Проблема.Установить(Ссылка);
	
	Для ТекИндекс = 0 По 4 Цикл
		Если ТекущаяДата <= ДатыНотификации[ТекИндекс] Тогда
			ЗаписьРегистра = НЗ.Добавить();
			ЗаписьРегистра.Проблема = Ссылка;
			ЗаписьРегистра.Уровень = МассивУровней[Макс(ИндексУровня, ТекИндекс)];
			ЗаписьРегистра.ВидУведомления = ВидыНотификаций[ТекИндекс];
			ЗаписьРегистра.ДатаУведомления = ДатыНотификации[ТекИндекс];
			ПодчиненныеУровни = СтруктураПодчиненияУровней[ЗаписьРегистра.Уровень];
			Для каждого ПодчиненныйУровень Из ПодчиненныеУровни Цикл
				ЗаписьПодчиненногоУровня = НЗ.Добавить();
				ЗаполнитьЗначенияСвойств(ЗаписьПодчиненногоУровня, ЗаписьРегистра);
				ЗаписьПодчиненногоУровня.Уровень = ПодчиненныйУровень;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	//Если ТекущаяДата <= DateNotification1 Тогда
	//	ЗаписьРегистра = НЗ.Добавить();
	//	ЗаписьРегистра.Проблема = Ссылка;
	//	ЗаписьРегистра.Уровень = МассивУровней[Макс(ИндексУровня, 0)];
	//	ЗаписьРегистра.ДатаУведомления = DateNotification1;
	//КонецЕсли;
	//
	//Если ТекущаяДата <= DateNotification2 Тогда
	//	ЗаписьРегистра = НЗ.Добавить();
	//	ЗаписьРегистра.Проблема = Ссылка;
	//	ЗаписьРегистра.ДатаУведомления = DateNotification1;
	//КонецЕсли;
	//
	//ЗаписьРегистра = НЗ.Добавить();
	//ЗаписьРегистра.Проблема = Ссылка;
	//ЗаписьРегистра.ДатаУведомления = FollowUpDate;
	//
	//ТаблицаУровней = Справочники.EscalationLevels.ПолучитьВышестоящиеУровни(EscalateTo, Истина);
	//
	//Для каждого СтрокаУровня Из ТаблицаУровней Цикл
	//	
	//	ЗаписьРегистра = НЗ.Добавить();
	//	ЗаписьРегистра.Проблема = Ссылка;
	//	ЗаписьРегистра.Уровень = СтрокаУровня.Ссылка;
	//	ЗаписьРегистра.ДатаУведомления = FollowUpDate + СтрокаУровня.DaysFromTheStartingDate * 24 * 60 * 60;
	//	
	//КонецЦикла;
	
	НЗ.Записать(Истина);
	
КонецПроцедуры

#КонецЕсли
